In [1]:
import pandas as pd
import csv
import sqlite3

data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}
purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [2]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [3]:
purchases.loc['June']

apples     3
oranges    0
Name: June, dtype: int64

In [4]:
import csv

# Example data: List of purchases with names
purchases_data = [
    ['apple', 'oranges'],
    ['June', 3, 0],
    ['Robert', 2, 3],
    ['Lily', 0, 7],
    ['David', 1, 2]
]

# Specify the file path
csv_file_path = 'purchases.csv'

# Write data to CSV file
with open(csv_file_path, 'w', newline='') as csvfile:
    csv_writer = csv.writer(csvfile)
    
    # Write the header
    csv_writer.writerow(purchases_data[0])
    
    # Write the data rows
    csv_writer.writerows(purchases_data[1:])

print(f'CSV file "{csv_file_path}" created successfully.')

CSV file "purchases.csv" created successfully.

In [5]:
df = pd.read_csv('purchases.csv')

df

        apple  oranges
June        3        0
Robert      2        3
Lily        0        7
David       1        2

In [6]:
import sqlite3

In [8]:
df.head()
df

        apple  oranges
June        3        0
Robert      2        3
Lily        0        7
David       1        2